package by.bog.practice;
/*Дан массив целых чисел.
 Найти сумму всех элементов массива, которые являются четными числами, и вывести её, если она больше 100.
 Если таких элементов нет, вывести сообщение "Нет четных чисел"

 1) Создаем массив целых чисел
 2) Создаем переменную для суммы
 3) Проитерируемся по массиву
 4) Проверяем на четность числа в цикле
 5) Если число четное прибовляем к результату(общей сумме)
 6) Если сумма больше 100 то выводим сумму
 7) Еслм нет четных в массиве то вывести сообщение ("Нет четных чисел")

 .*/


public class Task5 {
    public static void main(String[] args) {
        boolean allNechet = true;
        int[] array = {240, 12, 11, 23, 15};
        int sum = 0;
        for (int i = 0; i < array.length; i++) {
            if (array[i] % 2 == 0) {
                sum = array[i] + sum;
                allNechet = false;
            }
        }
        if (allNechet) {
            System.out.println("Нет четных чисел");
        } else if (sum > 100) {
            System.out.println(sum);
            System.out.println();
        }
    }
}
